using System;

namespace MyApp // Note: actual namespace depends on the project name.
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Task1();
            // Task2();
            // Task3();
            // Task4();
            // Task5();
            // Task6();
            // Task7();
        }
    }

    #region Task1
    //     1. Написать метод, рассчитывающий число из ряда Фиббоначчи используя
    // рекурсию
    

    #endregion


    #region  Task2
//     2. Дано натуральное число (вводится с клавиатуры). Вычислите сумму его цифр
// используя рекурсию


#endregion

#region Task3
// 3. Дано натуральное число больше 1 (вводится с клавиатуры). Выведите все простые
// делители этого числа используя рекурсию 

#endregion


#region Task4
// 4. Дано натуральное число больше 1 (вводится с клавиатуры). Выведите «Точная
// степень двойки», если число является точной степенью двойки, или «Не
// являеться степенью двойки», в противном случае используя рекурсию.


#endregion


#region Task5
// 5. Написать метод возвращающий индекс максимального и минимального
// значения массива (два способа используя кортеж и out).

#endregion


#region Task6
// 6. На входе 2 числа, написать метод по замене местами чисел в переменных, если
// первое число кратно двум, второе не кратно и первое число меньше двух
// (результат вернуть в виде кортежа)

#endregion


#region Task7
// 7. Дана строка. Написать метод по подсчёту количеству вхождений символа
// (подстроки). Метод возвращает символ (подстроку), количество вхождений, перое
// и последнее вхождение в строку. (использовать IndexOf, LastIndexOf, Split и тд
// запрещено)


#endregion


}